app/views/gossip/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---

<p>Auteur du Potin : <%=@current_gossip.user.first_name %> </p>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 7]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 13]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 16]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---

Commentaires (<%=@current_gossip.comments.count%>) :
<div class="container text-center">
    <%@current_gossip.comments.each do |elem|%>
        <p><strong> <%= elem.user.first_name%></strong> :