app/controllers/comment_controller.rb

  def create
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @comment = Comment.new(
      'user_id' => User.all.sample.id,
      'gossip_id' => @current_gossip.id,
      'content' => params[:content]
    )
    puts params
    if @comment.save
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
INSERT INTO "comments" ("content", "gossip_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Salut"], ["gossip_id", 7], ["created_at", "2023-05-10 13:20:35.736060"], ["updated_at", "2023-05-10 13:20:35.736060"], ["user_id", 6]]

  def edit
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 16], ["id", 24], ["LIMIT", 1]]

  def update
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
    comment_params = params.permit(:content)
    if @current_comment.update(comment_params)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 16], ["id", 24], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "PLutot non"], ["updated_at", "2023-05-10 14:25:32.238705"], ["id", 24]]

  def destroy
    @current_gossip = Gossip.find(params[:gossip_id].to_i)
    @current_comment = @current_gossip.comments.find(params[:id].to_i)
    if @current_comment.destroy
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["gossip_id", 16], ["id", 23], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 23]]