app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @all_gossips = Gossip.all

SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Nouveau"], ["content", "Nvwealsdjqweasd"], ["user_id", 9], ["created_at", "2023-05-10 16:02:54.652115"], ["updated_at", "2023-05-10 16:02:54.652115"]]
INSERT INTO "intertags" ("gossip_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gossip_id", 21], ["tag_id", 2], ["created_at", "2023-05-10 16:02:54.661459"], ["updated_at", "2023-05-10 16:02:54.661459"]]
---
  def create
    @gossip = Gossip.new('user_id' => User.all.sample.id,
                   'title' => params[:title],
                   'content' => params[:content])
    params[:tag_ids].each do |tag_id|
      @gossip.intertags.build(tag_id: tag_id)
    end
    if @gossip.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @current_gossip = Gossip.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @current_gossip = Gossip.find(params[:id].to_i)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "modified"], ["content", "modifiedmodifiedmodifiedmodified"], ["updated_at", "2023-05-10 11:37:35.473433"], ["id", 2]]
---
  def update
    @current_gossip = Gossip.find(params[:id].to_i)
    gossip_params = params.permit(:title, :content)
    #@current_gossip.update(gossip_params)
    if @current_gossip.update(gossip_params)

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 3]]
---
  def destroy
    @current_gossip = Gossip.find(params[:id].to_i)
    @current_gossip.destroy